event-platform/loadtest/allure-results/70b672ba-a5cd-4c64-bfe5-fafbb697be07-attachment.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/k6_10k_500kb.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * load_test: 10000 iterations shared among 50 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m00.8s), 50/50 VUs, 2 complete and 0 interrupted iterations
load_test   [   0% ] 50 VUs  00m00.8s/10m0s  00002/10000 shared iters

running (00m01.8s), 50/50 VUs, 5 complete and 0 interrupted iterations
load_test   [   0% ] 50 VUs  00m01.8s/10m0s  00005/10000 shared iters

running (00m02.8s), 50/50 VUs, 63 complete and 0 interrupted iterations
load_test   [   1% ] 50 VUs  00m02.8s/10m0s  00063/10000 shared iters

running (00m03.8s), 50/50 VUs, 71 complete and 0 interrupted iterations
load_test   [   1% ] 50 VUs  00m03.8s/10m0s  00071/10000 shared iters

running (00m04.8s), 50/50 VUs, 124 complete and 0 interrupted iterations
load_test   [   1% ] 50 VUs  00m04.8s/10m0s  00124/10000 shared iters

running (00m05.8s), 50/50 VUs, 142 complete and 0 interrupted iterations
load_test   [   1% ] 50 VUs  00m05.8s/10m0s  00142/10000 shared iters

running (00m06.8s), 50/50 VUs, 174 complete and 0 interrupted iterations
load_test   [   2% ] 50 VUs  00m06.8s/10m0s  00174/10000 shared iters

running (00m07.8s), 50/50 VUs, 211 complete and 0 interrupted iterations
load_test   [   2% ] 50 VUs  00m07.8s/10m0s  00211/10000 shared iters

running (00m08.8s), 50/50 VUs, 240 complete and 0 interrupted iterations
load_test   [   2% ] 50 VUs  00m08.8s/10m0s  00240/10000 shared iters

running (00m09.8s), 50/50 VUs, 261 complete and 0 interrupted iterations
load_test   [   3% ] 50 VUs  00m09.8s/10m0s  00261/10000 shared iters

running (00m10.8s), 50/50 VUs, 301 complete and 0 interrupted iterations
load_test   [   3% ] 50 VUs  00m10.8s/10m0s  00301/10000 shared iters

running (00m11.8s), 50/50 VUs, 330 complete and 0 interrupted iterations
load_test   [   3% ] 50 VUs  00m11.8s/10m0s  00330/10000 shared iters

running (00m12.8s), 50/50 VUs, 379 complete and 0 interrupted iterations
load_test   [   4% ] 50 VUs  00m12.8s/10m0s  00379/10000 shared iters

running (00m13.8s), 50/50 VUs, 396 complete and 0 interrupted iterations
load_test   [   4% ] 50 VUs  00m13.8s/10m0s  00396/10000 shared iters

running (00m14.8s), 50/50 VUs, 415 complete and 0 interrupted iterations
load_test   [   4% ] 50 VUs  00m14.8s/10m0s  00415/10000 shared iters

running (00m15.8s), 50/50 VUs, 470 complete and 0 interrupted iterations
load_test   [   5% ] 50 VUs  00m15.8s/10m0s  00470/10000 shared iters

running (00m16.8s), 50/50 VUs, 481 complete and 0 interrupted iterations
load_test   [   5% ] 50 VUs  00m16.8s/10m0s  00481/10000 shared iters

running (00m17.8s), 50/50 VUs, 538 complete and 0 interrupted iterations
load_test   [   5% ] 50 VUs  00m17.8s/10m0s  00538/10000 shared iters

running (00m18.8s), 50/50 VUs, 550 complete and 0 interrupted iterations
load_test   [   6% ] 50 VUs  00m18.8s/10m0s  00550/10000 shared iters

running (00m19.8s), 50/50 VUs, 596 complete and 0 interrupted iterations
load_test   [   6% ] 50 VUs  00m19.8s/10m0s  00596/10000 shared iters

running (00m20.8s), 50/50 VUs, 617 complete and 0 interrupted iterations
load_test   [   6% ] 50 VUs  00m20.8s/10m0s  00617/10000 shared iters

running (00m21.8s), 50/50 VUs, 639 complete and 0 interrupted iterations
load_test   [   6% ] 50 VUs  00m21.8s/10m0s  00639/10000 shared iters

running (00m22.8s), 50/50 VUs, 686 complete and 0 interrupted iterations
load_test   [   7% ] 50 VUs  00m22.8s/10m0s  00686/10000 shared iters

running (00m23.8s), 50/50 VUs, 721 complete and 0 interrupted iterations
load_test   [   7% ] 50 VUs  00m23.8s/10m0s  00721/10000 shared iters

running (00m24.8s), 50/50 VUs, 759 complete and 0 interrupted iterations
load_test   [   8% ] 50 VUs  00m24.8s/10m0s  00759/10000 shared iters

running (00m25.8s), 50/50 VUs, 761 complete and 0 interrupted iterations
load_test   [   8% ] 50 VUs  00m25.8s/10m0s  00761/10000 shared iters

running (00m26.8s), 50/50 VUs, 822 complete and 0 interrupted iterations
load_test   [   8% ] 50 VUs  00m26.8s/10m0s  00822/10000 shared iters

running (00m27.8s), 50/50 VUs, 849 complete and 0 interrupted iterations
load_test   [   8% ] 50 VUs  00m27.8s/10m0s  00849/10000 shared iters

running (00m28.8s), 50/50 VUs, 898 complete and 0 interrupted iterations
load_test   [   9% ] 50 VUs  00m28.8s/10m0s  00898/10000 shared iters

running (00m29.8s), 50/50 VUs, 910 complete and 0 interrupted iterations
load_test   [   9% ] 50 VUs  00m29.8s/10m0s  00910/10000 shared iters

running (00m30.8s), 50/50 VUs, 960 complete and 0 interrupted iterations
load_test   [  10% ] 50 VUs  00m30.8s/10m0s  00960/10000 shared iters

running (00m31.8s), 50/50 VUs, 966 complete and 0 interrupted iterations
load_test   [  10% ] 50 VUs  00m31.8s/10m0s  00966/10000 shared iters

running (00m32.8s), 50/50 VUs, 1008 complete and 0 interrupted iterations
load_test   [  10% ] 50 VUs  00m32.8s/10m0s  01008/10000 shared iters

running (00m33.8s), 50/50 VUs, 1032 complete and 0 interrupted iterations
load_test   [  10% ] 50 VUs  00m33.8s/10m0s  01032/10000 shared iters

running (00m34.8s), 50/50 VUs, 1073 complete and 0 interrupted iterations
load_test   [  11% ] 50 VUs  00m34.8s/10m0s  01073/10000 shared iters

running (00m35.8s), 50/50 VUs, 1119 complete and 0 interrupted iterations
load_test   [  11% ] 50 VUs  00m35.8s/10m0s  01119/10000 shared iters

running (00m36.8s), 50/50 VUs, 1139 complete and 0 interrupted iterations
load_test   [  11% ] 50 VUs  00m36.8s/10m0s  01139/10000 shared iters

running (00m37.8s), 50/50 VUs, 1187 complete and 0 interrupted iterations
load_test   [  12% ] 50 VUs  00m37.8s/10m0s  01187/10000 shared iters

running (00m38.8s), 50/50 VUs, 1197 complete and 0 interrupted iterations
load_test   [  12% ] 50 VUs  00m38.8s/10m0s  01197/10000 shared iters

running (00m39.8s), 50/50 VUs, 1253 complete and 0 interrupted iterations
load_test   [  13% ] 50 VUs  00m39.8s/10m0s  01253/10000 shared iters

running (00m40.8s), 50/50 VUs, 1269 complete and 0 interrupted iterations
load_test   [  13% ] 50 VUs  00m40.8s/10m0s  01269/10000 shared iters

running (00m41.8s), 50/50 VUs, 1281 complete and 0 interrupted iterations
load_test   [  13% ] 50 VUs  00m41.8s/10m0s  01281/10000 shared iters

running (00m42.8s), 50/50 VUs, 1326 complete and 0 interrupted iterations
load_test   [  13% ] 50 VUs  00m42.8s/10m0s  01326/10000 shared iters

running (00m43.8s), 50/50 VUs, 1351 complete and 0 interrupted iterations
load_test   [  14% ] 50 VUs  00m43.8s/10m0s  01351/10000 shared iters

running (00m44.8s), 50/50 VUs, 1372 complete and 0 interrupted iterations
load_test   [  14% ] 50 VUs  00m44.8s/10m0s  01372/10000 shared iters

running (00m45.8s), 50/50 VUs, 1404 complete and 0 interrupted iterations
load_test   [  14% ] 50 VUs  00m45.8s/10m0s  01404/10000 shared iters

running (00m46.8s), 50/50 VUs, 1411 complete and 0 interrupted iterations
load_test   [  14% ] 50 VUs  00m46.8s/10m0s  01411/10000 shared iters

running (00m47.8s), 50/50 VUs, 1423 complete and 0 interrupted iterations
load_test   [  14% ] 50 VUs  00m47.8s/10m0s  01423/10000 shared iters

running (00m48.8s), 50/50 VUs, 1471 complete and 0 interrupted iterations
load_test   [  15% ] 50 VUs  00m48.8s/10m0s  01471/10000 shared iters

running (00m49.8s), 50/50 VUs, 1488 complete and 0 interrupted iterations
load_test   [  15% ] 50 VUs  00m49.8s/10m0s  01488/10000 shared iters

running (00m50.8s), 50/50 VUs, 1517 complete and 0 interrupted iterations
load_test   [  15% ] 50 VUs  00m50.8s/10m0s  01517/10000 shared iters

running (00m51.8s), 50/50 VUs, 1563 complete and 0 interrupted iterations
load_test   [  16% ] 50 VUs  00m51.8s/10m0s  01563/10000 shared iters

running (00m52.8s), 50/50 VUs, 1595 complete and 0 interrupted iterations
load_test   [  16% ] 50 VUs  00m52.8s/10m0s  01595/10000 shared iters

running (00m53.9s), 50/50 VUs, 1643 complete and 0 interrupted iterations
load_test   [  16% ] 50 VUs  00m53.9s/10m0s  01643/10000 shared iters

running (00m54.8s), 50/50 VUs, 1664 complete and 0 interrupted iterations
load_test   [  17% ] 50 VUs  00m54.8s/10m0s  01664/10000 shared iters

running (00m55.8s), 50/50 VUs, 1722 complete and 0 interrupted iterations
load_test   [  17% ] 50 VUs  00m55.8s/10m0s  01722/10000 shared iters

running (00m56.9s), 50/50 VUs, 1769 complete and 0 interrupted iterations
load_test   [  18% ] 50 VUs  00m56.9s/10m0s  01769/10000 shared iters

running (00m57.8s), 50/50 VUs, 1790 complete and 0 interrupted iterations
load_test   [  18% ] 50 VUs  00m57.8s/10m0s  01790/10000 shared iters

running (00m58.8s), 50/50 VUs, 1832 complete and 0 interrupted iterations
load_test   [  18% ] 50 VUs  00m58.8s/10m0s  01832/10000 shared iters

running (00m59.8s), 50/50 VUs, 1881 complete and 0 interrupted iterations
load_test   [  19% ] 50 VUs  00m59.8s/10m0s  01881/10000 shared iters

running (01m00.8s), 50/50 VUs, 1909 complete and 0 interrupted iterations
load_test   [  19% ] 50 VUs  01m00.8s/10m0s  01909/10000 shared iters

running (01m01.8s), 50/50 VUs, 1968 complete and 0 interrupted iterations
load_test   [  20% ] 50 VUs  01m01.8s/10m0s  01968/10000 shared iters

running (01m02.8s), 50/50 VUs, 1994 complete and 0 interrupted iterations
load_test   [  20% ] 50 VUs  01m02.8s/10m0s  01994/10000 shared iters

running (01m03.8s), 50/50 VUs, 2042 complete and 0 interrupted iterations
load_test   [  20% ] 50 VUs  01m03.8s/10m0s  02042/10000 shared iters

running (01m04.8s), 50/50 VUs, 2063 complete and 0 interrupted iterations
load_test   [  21% ] 50 VUs  01m04.8s/10m0s  02063/10000 shared iters

running (01m05.8s), 50/50 VUs, 2114 complete and 0 interrupted iterations
load_test   [  21% ] 50 VUs  01m05.8s/10m0s  02114/10000 shared iters

running (01m06.8s), 50/50 VUs, 2140 complete and 0 interrupted iterations
load_test   [  21% ] 50 VUs  01m06.8s/10m0s  02140/10000 shared iters

running (01m07.8s), 50/50 VUs, 2191 complete and 0 interrupted iterations
load_test   [  22% ] 50 VUs  01m07.8s/10m0s  02191/10000 shared iters

running (01m08.8s), 50/50 VUs, 2233 complete and 0 interrupted iterations
load_test   [  22% ] 50 VUs  01m08.8s/10m0s  02233/10000 shared iters

running (01m09.8s), 50/50 VUs, 2275 complete and 0 interrupted iterations
load_test   [  23% ] 50 VUs  01m09.8s/10m0s  02275/10000 shared iters

running (01m10.8s), 50/50 VUs, 2296 complete and 0 interrupted iterations
load_test   [  23% ] 50 VUs  01m10.8s/10m0s  02296/10000 shared iters

running (01m11.8s), 50/50 VUs, 2343 complete and 0 interrupted iterations
load_test   [  23% ] 50 VUs  01m11.8s/10m0s  02343/10000 shared iters

running (01m12.8s), 50/50 VUs, 2373 complete and 0 interrupted iterations
load_test   [  24% ] 50 VUs  01m12.8s/10m0s  02373/10000 shared iters

running (01m13.8s), 50/50 VUs, 2406 complete and 0 interrupted iterations
load_test   [  24% ] 50 VUs  01m13.8s/10m0s  02406/10000 shared iters

running (01m15.2s), 50/50 VUs, 2455 complete and 0 interrupted iterations
load_test   [  25% ] 50 VUs  01m15.2s/10m0s  02455/10000 shared iters

running (01m15.8s), 50/50 VUs, 2480 complete and 0 interrupted iterations
load_test   [  25% ] 50 VUs  01m15.8s/10m0s  02480/10000 shared iters

running (01m16.8s), 50/50 VUs, 2513 complete and 0 interrupted iterations
load_test   [  25% ] 50 VUs  01m16.8s/10m0s  02513/10000 shared iters

running (01m17.8s), 50/50 VUs, 2546 complete and 0 interrupted iterations
load_test   [  25% ] 50 VUs  01m17.8s/10m0s  02546/10000 shared iters

running (01m18.8s), 50/50 VUs, 2564 complete and 0 interrupted iterations
load_test   [  26% ] 50 VUs  01m18.8s/10m0s  02564/10000 shared iters

running (01m19.8s), 50/50 VUs, 2617 complete and 0 interrupted iterations
load_test   [  26% ] 50 VUs  01m19.8s/10m0s  02617/10000 shared iters

running (01m20.8s), 50/50 VUs, 2647 complete and 0 interrupted iterations
load_test   [  26% ] 50 VUs  01m20.8s/10m0s  02647/10000 shared iters

running (01m21.9s), 50/50 VUs, 2710 complete and 0 interrupted iterations
load_test   [  27% ] 50 VUs  01m21.9s/10m0s  02710/10000 shared iters

running (01m22.8s), 50/50 VUs, 2726 complete and 0 interrupted iterations
load_test   [  27% ] 50 VUs  01m22.8s/10m0s  02726/10000 shared iters

running (01m23.9s), 50/50 VUs, 2766 complete and 0 interrupted iterations
load_test   [  28% ] 50 VUs  01m23.9s/10m0s  02766/10000 shared iters

running (01m24.8s), 50/50 VUs, 2792 complete and 0 interrupted iterations
load_test   [  28% ] 50 VUs  01m24.8s/10m0s  02792/10000 shared iters

running (01m25.8s), 50/50 VUs, 2796 complete and 0 interrupted iterations
load_test   [  28% ] 50 VUs  01m25.8s/10m0s  02796/10000 shared iters

running (01m26.8s), 50/50 VUs, 2855 complete and 0 interrupted iterations
load_test   [  29% ] 50 VUs  01m26.8s/10m0s  02855/10000 shared iters

running (01m27.8s), 50/50 VUs, 2855 complete and 0 interrupted iterations
load_test   [  29% ] 50 VUs  01m27.8s/10m0s  02855/10000 shared iters

running (01m28.9s), 50/50 VUs, 2923 complete and 0 interrupted iterations
load_test   [  29% ] 50 VUs  01m28.9s/10m0s  02923/10000 shared iters

running (01m29.8s), 50/50 VUs, 2957 complete and 0 interrupted iterations
load_test   [  30% ] 50 VUs  01m29.8s/10m0s  02957/10000 shared iters

running (01m30.8s), 50/50 VUs, 2999 complete and 0 interrupted iterations
load_test   [  30% ] 50 VUs  01m30.8s/10m0s  02999/10000 shared iters

running (01m31.9s), 50/50 VUs, 3035 complete and 0 interrupted iterations
load_test   [  30% ] 50 VUs  01m31.9s/10m0s  03035/10000 shared iters

running (01m32.8s), 50/50 VUs, 3069 complete and 0 interrupted iterations
load_test   [  31% ] 50 VUs  01m32.8s/10m0s  03069/10000 shared iters

running (01m33.9s), 50/50 VUs, 3121 complete and 0 interrupted iterations
load_test   [  31% ] 50 VUs  01m33.9s/10m0s  03121/10000 shared iters

running (01m34.8s), 50/50 VUs, 3126 complete and 0 interrupted iterations
load_test   [  31% ] 50 VUs  01m34.8s/10m0s  03126/10000 shared iters

running (01m35.8s), 50/50 VUs, 3133 complete and 0 interrupted iterations
load_test   [  31% ] 50 VUs  01m35.8s/10m0s  03133/10000 shared iters

running (01m36.8s), 50/50 VUs, 3184 complete and 0 interrupted iterations
load_test   [  32% ] 50 VUs  01m36.8s/10m0s  03184/10000 shared iters

running (01m37.8s), 50/50 VUs, 3197 complete and 0 interrupted iterations
load_test   [  32% ] 50 VUs  01m37.8s/10m0s  03197/10000 shared iters

running (01m38.9s), 50/50 VUs, 3252 complete and 0 interrupted iterations
load_test   [  33% ] 50 VUs  01m38.9s/10m0s  03252/10000 shared iters

running (01m39.8s), 50/50 VUs, 3267 complete and 0 interrupted iterations
load_test   [  33% ] 50 VUs  01m39.8s/10m0s  03267/10000 shared iters

running (01m40.9s), 50/50 VUs, 3309 complete and 0 interrupted iterations
load_test   [  33% ] 50 VUs  01m40.9s/10m0s  03309/10000 shared iters

running (01m41.8s), 50/50 VUs, 3327 complete and 0 interrupted iterations
load_test   [  33% ] 50 VUs  01m41.8s/10m0s  03327/10000 shared iters

running (01m42.9s), 50/50 VUs, 3378 complete and 0 interrupted iterations
load_test   [  34% ] 50 VUs  01m42.9s/10m0s  03378/10000 shared iters

running (01m43.8s), 50/50 VUs, 3395 complete and 0 interrupted iterations
load_test   [  34% ] 50 VUs  01m43.8s/10m0s  03395/10000 shared iters

running (01m44.8s), 50/50 VUs, 3447 complete and 0 interrupted iterations
load_test   [  34% ] 50 VUs  01m44.8s/10m0s  03447/10000 shared iters

running (01m45.8s), 50/50 VUs, 3498 complete and 0 interrupted iterations
load_test   [  35% ] 50 VUs  01m45.8s/10m0s  03498/10000 shared iters

running (01m46.8s), 50/50 VUs, 3514 complete and 0 interrupted iterations
load_test   [  35% ] 50 VUs  01m46.8s/10m0s  03514/10000 shared iters

running (01m47.8s), 50/50 VUs, 3555 complete and 0 interrupted iterations
load_test   [  36% ] 50 VUs  01m47.8s/10m0s  03555/10000 shared iters

running (01m49.1s), 50/50 VUs, 3606 complete and 0 interrupted iterations
load_test   [  36% ] 50 VUs  01m49.1s/10m0s  03606/10000 shared iters

running (01m49.8s), 50/50 VUs, 3623 complete and 0 interrupted iterations
load_test   [  36% ] 50 VUs  01m49.8s/10m0s  03623/10000 shared iters

running (01m50.8s), 50/50 VUs, 3657 complete and 0 interrupted iterations
load_test   [  37% ] 50 VUs  01m50.8s/10m0s  03657/10000 shared iters

running (01m51.9s), 50/50 VUs, 3722 complete and 0 interrupted iterations
load_test   [  37% ] 50 VUs  01m51.9s/10m0s  03722/10000 shared iters

running (01m52.8s), 50/50 VUs, 3735 complete and 0 interrupted iterations
load_test   [  37% ] 50 VUs  01m52.8s/10m0s  03735/10000 shared iters

running (01m54.1s), 50/50 VUs, 3786 complete and 0 interrupted iterations
load_test   [  38% ] 50 VUs  01m54.1s/10m0s  03786/10000 shared iters

running (01m54.8s), 50/50 VUs, 3801 complete and 0 interrupted iterations
load_test   [  38% ] 50 VUs  01m54.8s/10m0s  03801/10000 shared iters

running (01m55.9s), 50/50 VUs, 3835 complete and 0 interrupted iterations
load_test   [  38% ] 50 VUs  01m55.9s/10m0s  03835/10000 shared iters

running (01m56.8s), 50/50 VUs, 3863 complete and 0 interrupted iterations
load_test   [  39% ] 50 VUs  01m56.8s/10m0s  03863/10000 shared iters

running (01m57.9s), 50/50 VUs, 3906 complete and 0 interrupted iterations
load_test   [  39% ] 50 VUs  01m57.9s/10m0s  03906/10000 shared iters

running (01m58.8s), 50/50 VUs, 3924 complete and 0 interrupted iterations
load_test   [  39% ] 50 VUs  01m58.8s/10m0s  03924/10000 shared iters

running (01m59.8s), 50/50 VUs, 3941 complete and 0 interrupted iterations
load_test   [  39% ] 50 VUs  01m59.8s/10m0s  03941/10000 shared iters

running (02m02.0s), 50/50 VUs, 3996 complete and 0 interrupted iterations
load_test   [  40% ] 50 VUs  02m02.0s/10m0s  03996/10000 shared iters

running (02m03.0s), 50/50 VUs, 4005 complete and 0 interrupted iterations
load_test   [  40% ] 50 VUs  02m03.0s/10m0s  04005/10000 shared iters

running (02m03.8s), 50/50 VUs, 4006 complete and 0 interrupted iterations
load_test   [  40% ] 50 VUs  02m03.8s/10m0s  04006/10000 shared iters

running (02m04.9s), 50/50 VUs, 4048 complete and 0 interrupted iterations
load_test   [  40% ] 50 VUs  02m04.9s/10m0s  04048/10000 shared iters

running (02m05.8s), 50/50 VUs, 4070 complete and 0 interrupted iterations
load_test   [  41% ] 50 VUs  02m05.8s/10m0s  04070/10000 shared iters

running (02m06.8s), 50/50 VUs, 4076 complete and 0 interrupted iterations
load_test   [  41% ] 50 VUs  02m06.8s/10m0s  04076/10000 shared iters

running (02m07.8s), 50/50 VUs, 4079 complete and 0 interrupted iterations
load_test   [  41% ] 50 VUs  02m07.8s/10m0s  04079/10000 shared iters

running (02m08.8s), 50/50 VUs, 4079 complete and 0 interrupted iterations
load_test   [  41% ] 50 VUs  02m08.8s/10m0s  04079/10000 shared iters

running (02m09.9s), 50/50 VUs, 4134 complete and 0 interrupted iterations
load_test   [  41% ] 50 VUs  02m09.9s/10m0s  04134/10000 shared iters

running (02m10.8s), 50/50 VUs, 4142 complete and 0 interrupted iterations
load_test   [  41% ] 50 VUs  02m10.8s/10m0s  04142/10000 shared iters

running (02m11.8s), 50/50 VUs, 4151 complete and 0 interrupted iterations
load_test   [  42% ] 50 VUs  02m11.8s/10m0s  04151/10000 shared iters

running (02m12.8s), 50/50 VUs, 4156 complete and 0 interrupted iterations
load_test   [  42% ] 50 VUs  02m12.8s/10m0s  04156/10000 shared iters

running (02m13.9s), 50/50 VUs, 4223 complete and 0 interrupted iterations
load_test   [  42% ] 50 VUs  02m13.9s/10m0s  04223/10000 shared iters

running (02m15.0s), 50/50 VUs, 4243 complete and 0 interrupted iterations
load_test   [  42% ] 50 VUs  02m15.0s/10m0s  04243/10000 shared iters

running (02m15.9s), 50/50 VUs, 4269 complete and 0 interrupted iterations
load_test   [  43% ] 50 VUs  02m15.9s/10m0s  04269/10000 shared iters

running (02m16.8s), 50/50 VUs, 4307 complete and 0 interrupted iterations
load_test   [  43% ] 50 VUs  02m16.8s/10m0s  04307/10000 shared iters

running (02m17.9s), 50/50 VUs, 4323 complete and 0 interrupted iterations
load_test   [  43% ] 50 VUs  02m17.9s/10m0s  04323/10000 shared iters

running (02m18.8s), 50/50 VUs, 4353 complete and 0 interrupted iterations
load_test   [  44% ] 50 VUs  02m18.8s/10m0s  04353/10000 shared iters

running (02m19.8s), 50/50 VUs, 4377 complete and 0 interrupted iterations
load_test   [  44% ] 50 VUs  02m19.8s/10m0s  04377/10000 shared iters

running (02m20.8s), 50/50 VUs, 4428 complete and 0 interrupted iterations
load_test   [  44% ] 50 VUs  02m20.8s/10m0s  04428/10000 shared iters

running (02m21.9s), 50/50 VUs, 4442 complete and 0 interrupted iterations
load_test   [  44% ] 50 VUs  02m21.9s/10m0s  04442/10000 shared iters

running (02m22.8s), 50/50 VUs, 4461 complete and 0 interrupted iterations
load_test   [  45% ] 50 VUs  02m22.8s/10m0s  04461/10000 shared iters

running (02m24.0s), 50/50 VUs, 4517 complete and 0 interrupted iterations
load_test   [  45% ] 50 VUs  02m24.0s/10m0s  04517/10000 shared iters

running (02m24.9s), 50/50 VUs, 4544 complete and 0 interrupted iterations
load_test   [  45% ] 50 VUs  02m24.9s/10m0s  04544/10000 shared iters

running (02m25.8s), 50/50 VUs, 4558 complete and 0 interrupted iterations
load_test   [  46% ] 50 VUs  02m25.8s/10m0s  04558/10000 shared iters

running (02m26.8s), 50/50 VUs, 4615 complete and 0 interrupted iterations
load_test   [  46% ] 50 VUs  02m26.8s/10m0s  04615/10000 shared iters

running (02m27.9s), 50/50 VUs, 4649 complete and 0 interrupted iterations
load_test   [  46% ] 50 VUs  02m27.9s/10m0s  04649/10000 shared iters

running (02m28.8s), 50/50 VUs, 4667 complete and 0 interrupted iterations
load_test   [  47% ] 50 VUs  02m28.8s/10m0s  04667/10000 shared iters

running (02m30.0s), 50/50 VUs, 4719 complete and 0 interrupted iterations
load_test   [  47% ] 50 VUs  02m30.0s/10m0s  04719/10000 shared iters

running (02m30.8s), 50/50 VUs, 4731 complete and 0 interrupted iterations
load_test   [  47% ] 50 VUs  02m30.8s/10m0s  04731/10000 shared iters

running (02m31.9s), 50/50 VUs, 4789 complete and 0 interrupted iterations
load_test   [  48% ] 50 VUs  02m31.9s/10m0s  04789/10000 shared iters

running (02m32.8s), 50/50 VUs, 4804 complete and 0 interrupted iterations
load_test   [  48% ] 50 VUs  02m32.8s/10m0s  04804/10000 shared iters

running (02m33.9s), 50/50 VUs, 4852 complete and 0 interrupted iterations
load_test   [  49% ] 50 VUs  02m33.9s/10m0s  04852/10000 shared iters

running (02m34.8s), 50/50 VUs, 4867 complete and 0 interrupted iterations
load_test   [  49% ] 50 VUs  02m34.8s/10m0s  04867/10000 shared iters

running (02m35.8s), 50/50 VUs, 4901 complete and 0 interrupted iterations
load_test   [  49% ] 50 VUs  02m35.8s/10m0s  04901/10000 shared iters

running (02m36.8s), 50/50 VUs, 4928 complete and 0 interrupted iterations
load_test   [  49% ] 50 VUs  02m36.8s/10m0s  04928/10000 shared iters

running (02m37.9s), 50/50 VUs, 4973 complete and 0 interrupted iterations
load_test   [  50% ] 50 VUs  02m37.9s/10m0s  04973/10000 shared iters

running (02m38.8s), 50/50 VUs, 4995 complete and 0 interrupted iterations
load_test   [  50% ] 50 VUs  02m38.8s/10m0s  04995/10000 shared iters

running (02m40.0s), 50/50 VUs, 5052 complete and 0 interrupted iterations
load_test   [  51% ] 50 VUs  02m40.0s/10m0s  05052/10000 shared iters

running (02m40.8s), 50/50 VUs, 5074 complete and 0 interrupted iterations
load_test   [  51% ] 50 VUs  02m40.8s/10m0s  05074/10000 shared iters

running (02m41.8s), 50/50 VUs, 5110 complete and 0 interrupted iterations
load_test   [  51% ] 50 VUs  02m41.8s/10m0s  05110/10000 shared iters

running (02m42.9s), 50/50 VUs, 5156 complete and 0 interrupted iterations
load_test   [  52% ] 50 VUs  02m42.9s/10m0s  05156/10000 shared iters

running (02m43.9s), 50/50 VUs, 5188 complete and 0 interrupted iterations
load_test   [  52% ] 50 VUs  02m43.9s/10m0s  05188/10000 shared iters

running (02m44.8s), 50/50 VUs, 5219 complete and 0 interrupted iterations
load_test   [  52% ] 50 VUs  02m44.8s/10m0s  05219/10000 shared iters

running (02m45.8s), 50/50 VUs, 5241 complete and 0 interrupted iterations
load_test   [  52% ] 50 VUs  02m45.8s/10m0s  05241/10000 shared iters

running (02m46.9s), 50/50 VUs, 5292 complete and 0 interrupted iterations
load_test   [  53% ] 50 VUs  02m46.9s/10m0s  05292/10000 shared iters

running (02m47.8s), 50/50 VUs, 5313 complete and 0 interrupted iterations
load_test   [  53% ] 50 VUs  02m47.8s/10m0s  05313/10000 shared iters

running (02m48.8s), 50/50 VUs, 5353 complete and 0 interrupted iterations
load_test   [  54% ] 50 VUs  02m48.8s/10m0s  05353/10000 shared iters

running (02m50.0s), 50/50 VUs, 5392 complete and 0 interrupted iterations
load_test   [  54% ] 50 VUs  02m50.0s/10m0s  05392/10000 shared iters

running (02m50.8s), 50/50 VUs, 5403 complete and 0 interrupted iterations
load_test   [  54% ] 50 VUs  02m50.8s/10m0s  05403/10000 shared iters

running (02m51.8s), 50/50 VUs, 5459 complete and 0 interrupted iterations
load_test   [  55% ] 50 VUs  02m51.8s/10m0s  05459/10000 shared iters

running (02m52.8s), 50/50 VUs, 5474 complete and 0 interrupted iterations
load_test   [  55% ] 50 VUs  02m52.8s/10m0s  05474/10000 shared iters

running (02m53.8s), 50/50 VUs, 5516 complete and 0 interrupted iterations
load_test   [  55% ] 50 VUs  02m53.8s/10m0s  05516/10000 shared iters

running (02m55.0s), 50/50 VUs, 5577 complete and 0 interrupted iterations
load_test   [  56% ] 50 VUs  02m55.0s/10m0s  05577/10000 shared iters

running (02m55.8s), 50/50 VUs, 5597 complete and 0 interrupted iterations
load_test   [  56% ] 50 VUs  02m55.8s/10m0s  05597/10000 shared iters

running (02m56.8s), 50/50 VUs, 5599 complete and 0 interrupted iterations
load_test   [  56% ] 50 VUs  02m56.8s/10m0s  05599/10000 shared iters

running (02m58.0s), 50/50 VUs, 5651 complete and 0 interrupted iterations
load_test   [  57% ] 50 VUs  02m58.0s/10m0s  05651/10000 shared iters

running (02m58.8s), 50/50 VUs, 5659 complete and 0 interrupted iterations
load_test   [  57% ] 50 VUs  02m58.8s/10m0s  05659/10000 shared iters

running (02m59.8s), 50/50 VUs, 5676 complete and 0 interrupted iterations
load_test   [  57% ] 50 VUs  02m59.8s/10m0s  05676/10000 shared iters

running (03m00.8s), 50/50 VUs, 5730 complete and 0 interrupted iterations
load_test   [  57% ] 50 VUs  03m00.8s/10m0s  05730/10000 shared iters

running (03m01.8s), 50/50 VUs, 5752 complete and 0 interrupted iterations
load_test   [  58% ] 50 VUs  03m01.8s/10m0s  05752/10000 shared iters

running (03m02.9s), 50/50 VUs, 5776 complete and 0 interrupted iterations
load_test   [  58% ] 50 VUs  03m02.9s/10m0s  05776/10000 shared iters

running (03m03.9s), 50/50 VUs, 5828 complete and 0 interrupted iterations
load_test   [  58% ] 50 VUs  03m03.9s/10m0s  05828/10000 shared iters

running (03m04.8s), 50/50 VUs, 5842 complete and 0 interrupted iterations
load_test   [  58% ] 50 VUs  03m04.8s/10m0s  05842/10000 shared iters

running (03m05.8s), 50/50 VUs, 5850 complete and 0 interrupted iterations
load_test   [  58% ] 50 VUs  03m05.8s/10m0s  05850/10000 shared iters

running (03m08.7s), 50/50 VUs, 5885 complete and 0 interrupted iterations
load_test   [  59% ] 50 VUs  03m08.7s/10m0s  05885/10000 shared iters

running (03m08.8s), 50/50 VUs, 5889 complete and 0 interrupted iterations
load_test   [  59% ] 50 VUs  03m08.8s/10m0s  05889/10000 shared iters

running (03m09.9s), 50/50 VUs, 5926 complete and 0 interrupted iterations
load_test   [  59% ] 50 VUs  03m09.9s/10m0s  05926/10000 shared iters

running (03m10.8s), 50/50 VUs, 5950 complete and 0 interrupted iterations
load_test   [  60% ] 50 VUs  03m10.8s/10m0s  05950/10000 shared iters

running (03m11.8s), 50/50 VUs, 5973 complete and 0 interrupted iterations
load_test   [  60% ] 50 VUs  03m11.8s/10m0s  05973/10000 shared iters

running (03m12.8s), 50/50 VUs, 6028 complete and 0 interrupted iterations
load_test   [  60% ] 50 VUs  03m12.8s/10m0s  06028/10000 shared iters

running (03m13.8s), 50/50 VUs, 6040 complete and 0 interrupted iterations
load_test   [  60% ] 50 VUs  03m13.8s/10m0s  06040/10000 shared iters

running (03m14.8s), 50/50 VUs, 6075 complete and 0 interrupted iterations
load_test   [  61% ] 50 VUs  03m14.8s/10m0s  06075/10000 shared iters

running (03m15.8s), 50/50 VUs, 6100 complete and 0 interrupted iterations
load_test   [  61% ] 50 VUs  03m15.8s/10m0s  06100/10000 shared iters

running (03m16.8s), 50/50 VUs, 6116 complete and 0 interrupted iterations
load_test   [  61% ] 50 VUs  03m16.8s/10m0s  06116/10000 shared iters

running (03m17.9s), 50/50 VUs, 6175 complete and 0 interrupted iterations
load_test   [  62% ] 50 VUs  03m17.9s/10m0s  06175/10000 shared iters

running (03m18.8s), 50/50 VUs, 6180 complete and 0 interrupted iterations
load_test   [  62% ] 50 VUs  03m18.8s/10m0s  06180/10000 shared iters

running (03m19.8s), 50/50 VUs, 6232 complete and 0 interrupted iterations
load_test   [  62% ] 50 VUs  03m19.8s/10m0s  06232/10000 shared iters

running (03m20.8s), 50/50 VUs, 6258 complete and 0 interrupted iterations
load_test   [  63% ] 50 VUs  03m20.8s/10m0s  06258/10000 shared iters

running (03m21.9s), 50/50 VUs, 6284 complete and 0 interrupted iterations
load_test   [  63% ] 50 VUs  03m21.9s/10m0s  06284/10000 shared iters

running (03m22.9s), 50/50 VUs, 6326 complete and 0 interrupted iterations
load_test   [  63% ] 50 VUs  03m22.9s/10m0s  06326/10000 shared iters

running (03m23.8s), 50/50 VUs, 6347 complete and 0 interrupted iterations
load_test   [  63% ] 50 VUs  03m23.8s/10m0s  06347/10000 shared iters

running (03m24.8s), 50/50 VUs, 6372 complete and 0 interrupted iterations
load_test   [  64% ] 50 VUs  03m24.8s/10m0s  06372/10000 shared iters

running (03m25.8s), 50/50 VUs, 6403 complete and 0 interrupted iterations
load_test   [  64% ] 50 VUs  03m25.8s/10m0s  06403/10000 shared iters

running (03m26.8s), 50/50 VUs, 6440 complete and 0 interrupted iterations
load_test   [  64% ] 50 VUs  03m26.8s/10m0s  06440/10000 shared iters

running (03m27.9s), 50/50 VUs, 6467 complete and 0 interrupted iterations
load_test   [  65% ] 50 VUs  03m27.9s/10m0s  06467/10000 shared iters

running (03m28.8s), 50/50 VUs, 6500 complete and 0 interrupted iterations
load_test   [  65% ] 50 VUs  03m28.8s/10m0s  06500/10000 shared iters

running (03m29.8s), 50/50 VUs, 6508 complete and 0 interrupted iterations
load_test   [  65% ] 50 VUs  03m29.8s/10m0s  06508/10000 shared iters

running (03m30.8s), 50/50 VUs, 6564 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m30.8s/10m0s  06564/10000 shared iters

running (03m31.9s), 50/50 VUs, 6571 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m31.9s/10m0s  06571/10000 shared iters

running (03m32.8s), 50/50 VUs, 6575 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m32.8s/10m0s  06575/10000 shared iters

running (03m33.9s), 50/50 VUs, 6624 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m33.9s/10m0s  06624/10000 shared iters

running (03m34.8s), 50/50 VUs, 6634 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m34.8s/10m0s  06634/10000 shared iters

running (03m35.8s), 50/50 VUs, 6634 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m35.8s/10m0s  06634/10000 shared iters

running (03m36.8s), 50/50 VUs, 6642 complete and 0 interrupted iterations
load_test   [  66% ] 50 VUs  03m36.8s/10m0s  06642/10000 shared iters

running (03m39.3s), 50/50 VUs, 6656 complete and 0 interrupted iterations
load_test   [  67% ] 50 VUs  03m39.3s/10m0s  06656/10000 shared iters

running (03m39.8s), 50/50 VUs, 6699 complete and 0 interrupted iterations
load_test   [  67% ] 50 VUs  03m39.8s/10m0s  06699/10000 shared iters

running (03m40.8s), 50/50 VUs, 6717 complete and 0 interrupted iterations
load_test   [  67% ] 50 VUs  03m40.8s/10m0s  06717/10000 shared iters

running (03m41.9s), 50/50 VUs, 6730 complete and 0 interrupted iterations
load_test   [  67% ] 50 VUs  03m41.9s/10m0s  06730/10000 shared iters

running (03m42.8s), 50/50 VUs, 6738 complete and 0 interrupted iterations
load_test   [  67% ] 50 VUs  03m42.8s/10m0s  06738/10000 shared iters

running (03m43.8s), 50/50 VUs, 6778 complete and 0 interrupted iterations
load_test   [  68% ] 50 VUs  03m43.8s/10m0s  06778/10000 shared iters

running (03m44.9s), 50/50 VUs, 6799 complete and 0 interrupted iterations
load_test   [  68% ] 50 VUs  03m44.9s/10m0s  06799/10000 shared iters

running (03m45.8s), 50/50 VUs, 6825 complete and 0 interrupted iterations
load_test   [  68% ] 50 VUs  03m45.8s/10m0s  06825/10000 shared iters

running (03m46.8s), 50/50 VUs, 6848 complete and 0 interrupted iterations
load_test   [  68% ] 50 VUs  03m46.8s/10m0s  06848/10000 shared iters

running (03m47.8s), 50/50 VUs, 6866 complete and 0 interrupted iterations
load_test   [  69% ] 50 VUs  03m47.8s/10m0s  06866/10000 shared iters

running (03m48.8s), 50/50 VUs, 6882 complete and 0 interrupted iterations
load_test   [  69% ] 50 VUs  03m48.8s/10m0s  06882/10000 shared iters

running (03m49.9s), 50/50 VUs, 6933 complete and 0 interrupted iterations
load_test   [  69% ] 50 VUs  03m49.9s/10m0s  06933/10000 shared iters

running (03m50.8s), 50/50 VUs, 6951 complete and 0 interrupted iterations
load_test   [  70% ] 50 VUs  03m50.8s/10m0s  06951/10000 shared iters

running (03m51.8s), 50/50 VUs, 6976 complete and 0 interrupted iterations
load_test   [  70% ] 50 VUs  03m51.8s/10m0s  06976/10000 shared iters

running (03m52.8s), 50/50 VUs, 7029 complete and 0 interrupted iterations
load_test   [  70% ] 50 VUs  03m52.8s/10m0s  07029/10000 shared iters

running (03m53.8s), 50/50 VUs, 7050 complete and 0 interrupted iterations
load_test   [  70% ] 50 VUs  03m53.8s/10m0s  07050/10000 shared iters

running (03m54.8s), 50/50 VUs, 7091 complete and 0 interrupted iterations
load_test   [  71% ] 50 VUs  03m54.8s/10m0s  07091/10000 shared iters

running (03m55.8s), 50/50 VUs, 7120 complete and 0 interrupted iterations
load_test   [  71% ] 50 VUs  03m55.8s/10m0s  07120/10000 shared iters

running (03m56.9s), 50/50 VUs, 7174 complete and 0 interrupted iterations
load_test   [  72% ] 50 VUs  03m56.9s/10m0s  07174/10000 shared iters

running (03m57.8s), 50/50 VUs, 7185 complete and 0 interrupted iterations
load_test   [  72% ] 50 VUs  03m57.8s/10m0s  07185/10000 shared iters

running (03m58.9s), 50/50 VUs, 7231 complete and 0 interrupted iterations
load_test   [  72% ] 50 VUs  03m58.9s/10m0s  07231/10000 shared iters

running (03m59.8s), 50/50 VUs, 7257 complete and 0 interrupted iterations
load_test   [  73% ] 50 VUs  03m59.8s/10m0s  07257/10000 shared iters

running (04m00.8s), 50/50 VUs, 7292 complete and 0 interrupted iterations
load_test   [  73% ] 50 VUs  04m00.8s/10m0s  07292/10000 shared iters

running (04m01.8s), 50/50 VUs, 7311 complete and 0 interrupted iterations
load_test   [  73% ] 50 VUs  04m01.8s/10m0s  07311/10000 shared iters

running (04m02.8s), 50/50 VUs, 7371 complete and 0 interrupted iterations
load_test   [  74% ] 50 VUs  04m02.8s/10m0s  07371/10000 shared iters

running (04m03.8s), 50/50 VUs, 7396 complete and 0 interrupted iterations
load_test   [  74% ] 50 VUs  04m03.8s/10m0s  07396/10000 shared iters

running (04m04.9s), 50/50 VUs, 7441 complete and 0 interrupted iterations
load_test   [  74% ] 50 VUs  04m04.9s/10m0s  07441/10000 shared iters

running (04m05.9s), 50/50 VUs, 7465 complete and 0 interrupted iterations
load_test   [  75% ] 50 VUs  04m05.9s/10m0s  07465/10000 shared iters

running (04m06.9s), 50/50 VUs, 7494 complete and 0 interrupted iterations
load_test   [  75% ] 50 VUs  04m06.9s/10m0s  07494/10000 shared iters

running (04m07.8s), 50/50 VUs, 7510 complete and 0 interrupted iterations
load_test   [  75% ] 50 VUs  04m07.8s/10m0s  07510/10000 shared iters

running (04m08.8s), 50/50 VUs, 7566 complete and 0 interrupted iterations
load_test   [  76% ] 50 VUs  04m08.8s/10m0s  07566/10000 shared iters

running (04m09.8s), 50/50 VUs, 7591 complete and 0 interrupted iterations
load_test   [  76% ] 50 VUs  04m09.8s/10m0s  07591/10000 shared iters

running (04m10.8s), 50/50 VUs, 7616 complete and 0 interrupted iterations
load_test   [  76% ] 50 VUs  04m10.8s/10m0s  07616/10000 shared iters

running (04m11.9s), 50/50 VUs, 7666 complete and 0 interrupted iterations
load_test   [  77% ] 50 VUs  04m11.9s/10m0s  07666/10000 shared iters

running (04m12.8s), 50/50 VUs, 7683 complete and 0 interrupted iterations
load_test   [  77% ] 50 VUs  04m12.8s/10m0s  07683/10000 shared iters

running (04m13.8s), 50/50 VUs, 7716 complete and 0 interrupted iterations
load_test   [  77% ] 50 VUs  04m13.8s/10m0s  07716/10000 shared iters

running (04m14.8s), 50/50 VUs, 7756 complete and 0 interrupted iterations
load_test   [  78% ] 50 VUs  04m14.8s/10m0s  07756/10000 shared iters

running (04m15.8s), 50/50 VUs, 7769 complete and 0 interrupted iterations
load_test   [  78% ] 50 VUs  04m15.8s/10m0s  07769/10000 shared iters

running (04m16.8s), 50/50 VUs, 7823 complete and 0 interrupted iterations
load_test   [  78% ] 50 VUs  04m16.8s/10m0s  07823/10000 shared iters

running (04m17.8s), 50/50 VUs, 7844 complete and 0 interrupted iterations
load_test   [  78% ] 50 VUs  04m17.8s/10m0s  07844/10000 shared iters

running (04m18.8s), 50/50 VUs, 7856 complete and 0 interrupted iterations
load_test   [  79% ] 50 VUs  04m18.8s/10m0s  07856/10000 shared iters

running (04m19.8s), 50/50 VUs, 7880 complete and 0 interrupted iterations
load_test   [  79% ] 50 VUs  04m19.8s/10m0s  07880/10000 shared iters

running (04m20.8s), 50/50 VUs, 7942 complete and 0 interrupted iterations
load_test   [  79% ] 50 VUs  04m20.8s/10m0s  07942/10000 shared iters

running (04m21.8s), 50/50 VUs, 7962 complete and 0 interrupted iterations
load_test   [  80% ] 50 VUs  04m21.8s/10m0s  07962/10000 shared iters

running (04m22.8s), 50/50 VUs, 8004 complete and 0 interrupted iterations
load_test   [  80% ] 50 VUs  04m22.8s/10m0s  08004/10000 shared iters

running (04m23.9s), 50/50 VUs, 8061 complete and 0 interrupted iterations
load_test   [  81% ] 50 VUs  04m23.9s/10m0s  08061/10000 shared iters

running (04m24.8s), 50/50 VUs, 8076 complete and 0 interrupted iterations
load_test   [  81% ] 50 VUs  04m24.8s/10m0s  08076/10000 shared iters

running (04m26.0s), 50/50 VUs, 8127 complete and 0 interrupted iterations
load_test   [  81% ] 50 VUs  04m26.0s/10m0s  08127/10000 shared iters

running (04m26.8s), 50/50 VUs, 8141 complete and 0 interrupted iterations
load_test   [  81% ] 50 VUs  04m26.8s/10m0s  08141/10000 shared iters

running (04m27.8s), 50/50 VUs, 8157 complete and 0 interrupted iterations
load_test   [  82% ] 50 VUs  04m27.8s/10m0s  08157/10000 shared iters

running (04m28.8s), 50/50 VUs, 8204 complete and 0 interrupted iterations
load_test   [  82% ] 50 VUs  04m28.8s/10m0s  08204/10000 shared iters

running (04m29.8s), 50/50 VUs, 8218 complete and 0 interrupted iterations
load_test   [  82% ] 50 VUs  04m29.8s/10m0s  08218/10000 shared iters

running (04m30.8s), 50/50 VUs, 8273 complete and 0 interrupted iterations
load_test   [  83% ] 50 VUs  04m30.8s/10m0s  08273/10000 shared iters

running (04m31.8s), 50/50 VUs, 8288 complete and 0 interrupted iterations
load_test   [  83% ] 50 VUs  04m31.8s/10m0s  08288/10000 shared iters

running (04m32.8s), 50/50 VUs, 8304 complete and 0 interrupted iterations
load_test   [  83% ] 50 VUs  04m32.8s/10m0s  08304/10000 shared iters

running (04m34.0s), 50/50 VUs, 8368 complete and 0 interrupted iterations
load_test   [  84% ] 50 VUs  04m34.0s/10m0s  08368/10000 shared iters

running (04m34.8s), 50/50 VUs, 8374 complete and 0 interrupted iterations
load_test   [  84% ] 50 VUs  04m34.8s/10m0s  08374/10000 shared iters

running (04m35.8s), 50/50 VUs, 8432 complete and 0 interrupted iterations
load_test   [  84% ] 50 VUs  04m35.8s/10m0s  08432/10000 shared iters

running (04m36.8s), 50/50 VUs, 8456 complete and 0 interrupted iterations
load_test   [  85% ] 50 VUs  04m36.8s/10m0s  08456/10000 shared iters

running (04m37.8s), 50/50 VUs, 8508 complete and 0 interrupted iterations
load_test   [  85% ] 50 VUs  04m37.8s/10m0s  08508/10000 shared iters

running (04m38.8s), 50/50 VUs, 8521 complete and 0 interrupted iterations
load_test   [  85% ] 50 VUs  04m38.8s/10m0s  08521/10000 shared iters

running (04m39.8s), 50/50 VUs, 8574 complete and 0 interrupted iterations
load_test   [  86% ] 50 VUs  04m39.8s/10m0s  08574/10000 shared iters

running (04m40.8s), 50/50 VUs, 8582 complete and 0 interrupted iterations
load_test   [  86% ] 50 VUs  04m40.8s/10m0s  08582/10000 shared iters

running (04m41.8s), 50/50 VUs, 8637 complete and 0 interrupted iterations
load_test   [  86% ] 50 VUs  04m41.8s/10m0s  08637/10000 shared iters

running (04m42.8s), 50/50 VUs, 8662 complete and 0 interrupted iterations
load_test   [  87% ] 50 VUs  04m42.8s/10m0s  08662/10000 shared iters

running (04m43.8s), 50/50 VUs, 8714 complete and 0 interrupted iterations
load_test   [  87% ] 50 VUs  04m43.8s/10m0s  08714/10000 shared iters

running (04m44.8s), 50/50 VUs, 8715 complete and 0 interrupted iterations
load_test   [  87% ] 50 VUs  04m44.8s/10m0s  08715/10000 shared iters

running (04m45.8s), 50/50 VUs, 8767 complete and 0 interrupted iterations
load_test   [  88% ] 50 VUs  04m45.8s/10m0s  08767/10000 shared iters

running (04m46.8s), 50/50 VUs, 8788 complete and 0 interrupted iterations
load_test   [  88% ] 50 VUs  04m46.8s/10m0s  08788/10000 shared iters

running (04m48.1s), 50/50 VUs, 8798 complete and 0 interrupted iterations
load_test   [  88% ] 50 VUs  04m48.1s/10m0s  08798/10000 shared iters

running (04m48.9s), 50/50 VUs, 8843 complete and 0 interrupted iterations
load_test   [  88% ] 50 VUs  04m48.9s/10m0s  08843/10000 shared iters

running (04m49.9s), 50/50 VUs, 8855 complete and 0 interrupted iterations
load_test   [  89% ] 50 VUs  04m49.9s/10m0s  08855/10000 shared iters

running (04m50.8s), 50/50 VUs, 8870 complete and 0 interrupted iterations
load_test   [  89% ] 50 VUs  04m50.8s/10m0s  08870/10000 shared iters

running (04m51.8s), 50/50 VUs, 8918 complete and 0 interrupted iterations
load_test   [  89% ] 50 VUs  04m51.8s/10m0s  08918/10000 shared iters

running (04m52.8s), 50/50 VUs, 8937 complete and 0 interrupted iterations
load_test   [  89% ] 50 VUs  04m52.8s/10m0s  08937/10000 shared iters

running (04m53.8s), 50/50 VUs, 8953 complete and 0 interrupted iterations
load_test   [  90% ] 50 VUs  04m53.8s/10m0s  08953/10000 shared iters

running (04m55.5s), 50/50 VUs, 9017 complete and 0 interrupted iterations
load_test   [  90% ] 50 VUs  04m55.5s/10m0s  09017/10000 shared iters

running (04m55.9s), 50/50 VUs, 9022 complete and 0 interrupted iterations
load_test   [  90% ] 50 VUs  04m55.9s/10m0s  09022/10000 shared iters

running (04m56.8s), 50/50 VUs, 9036 complete and 0 interrupted iterations
load_test   [  90% ] 50 VUs  04m56.8s/10m0s  09036/10000 shared iters

running (04m57.9s), 50/50 VUs, 9093 complete and 0 interrupted iterations
load_test   [  91% ] 50 VUs  04m57.9s/10m0s  09093/10000 shared iters

running (04m58.8s), 50/50 VUs, 9120 complete and 0 interrupted iterations
load_test   [  91% ] 50 VUs  04m58.8s/10m0s  09120/10000 shared iters

running (04m59.8s), 50/50 VUs, 9163 complete and 0 interrupted iterations
load_test   [  92% ] 50 VUs  04m59.8s/10m0s  09163/10000 shared iters

running (05m00.8s), 50/50 VUs, 9210 complete and 0 interrupted iterations
load_test   [  92% ] 50 VUs  05m00.8s/10m0s  09210/10000 shared iters

running (05m01.8s), 50/50 VUs, 9225 complete and 0 interrupted iterations
load_test   [  92% ] 50 VUs  05m01.8s/10m0s  09225/10000 shared iters

running (05m02.8s), 50/50 VUs, 9279 complete and 0 interrupted iterations
load_test   [  93% ] 50 VUs  05m02.8s/10m0s  09279/10000 shared iters

running (05m03.8s), 50/50 VUs, 9310 complete and 0 interrupted iterations
load_test   [  93% ] 50 VUs  05m03.8s/10m0s  09310/10000 shared iters

running (05m04.8s), 50/50 VUs, 9341 complete and 0 interrupted iterations
load_test   [  93% ] 50 VUs  05m04.8s/10m0s  09341/10000 shared iters

running (05m05.8s), 50/50 VUs, 9383 complete and 0 interrupted iterations
load_test   [  94% ] 50 VUs  05m05.8s/10m0s  09383/10000 shared iters

running (05m06.9s), 50/50 VUs, 9424 complete and 0 interrupted iterations
load_test   [  94% ] 50 VUs  05m06.9s/10m0s  09424/10000 shared iters

running (05m07.8s), 50/50 VUs, 9461 complete and 0 interrupted iterations
load_test   [  95% ] 50 VUs  05m07.8s/10m0s  09461/10000 shared iters

running (05m08.8s), 50/50 VUs, 9473 complete and 0 interrupted iterations
load_test   [  95% ] 50 VUs  05m08.8s/10m0s  09473/10000 shared iters

running (05m09.8s), 50/50 VUs, 9527 complete and 0 interrupted iterations
load_test   [  95% ] 50 VUs  05m09.8s/10m0s  09527/10000 shared iters

running (05m10.8s), 50/50 VUs, 9536 complete and 0 interrupted iterations
load_test   [  95% ] 50 VUs  05m10.8s/10m0s  09536/10000 shared iters

running (05m11.8s), 50/50 VUs, 9596 complete and 0 interrupted iterations
load_test   [  96% ] 50 VUs  05m11.8s/10m0s  09596/10000 shared iters

running (05m12.8s), 50/50 VUs, 9605 complete and 0 interrupted iterations
load_test   [  96% ] 50 VUs  05m12.8s/10m0s  09605/10000 shared iters

running (05m13.8s), 50/50 VUs, 9661 complete and 0 interrupted iterations
load_test   [  97% ] 50 VUs  05m13.8s/10m0s  09661/10000 shared iters

running (05m14.8s), 50/50 VUs, 9671 complete and 0 interrupted iterations
load_test   [  97% ] 50 VUs  05m14.8s/10m0s  09671/10000 shared iters

running (05m15.9s), 50/50 VUs, 9726 complete and 0 interrupted iterations
load_test   [  97% ] 50 VUs  05m15.9s/10m0s  09726/10000 shared iters

running (05m16.8s), 50/50 VUs, 9741 complete and 0 interrupted iterations
load_test   [  97% ] 50 VUs  05m16.8s/10m0s  09741/10000 shared iters

running (05m17.9s), 50/50 VUs, 9796 complete and 0 interrupted iterations
load_test   [  98% ] 50 VUs  05m17.9s/10m0s  09796/10000 shared iters

running (05m18.8s), 50/50 VUs, 9828 complete and 0 interrupted iterations
load_test   [  98% ] 50 VUs  05m18.8s/10m0s  09828/10000 shared iters

running (05m19.8s), 50/50 VUs, 9862 complete and 0 interrupted iterations
load_test   [  99% ] 50 VUs  05m19.8s/10m0s  09862/10000 shared iters

running (05m20.9s), 50/50 VUs, 9905 complete and 0 interrupted iterations
load_test   [  99% ] 50 VUs  05m20.9s/10m0s  09905/10000 shared iters

running (05m21.8s), 50/50 VUs, 9939 complete and 0 interrupted iterations
load_test   [  99% ] 50 VUs  05m21.8s/10m0s  09939/10000 shared iters

running (05m22.8s), 30/50 VUs, 9970 complete and 0 interrupted iterations
load_test   [ 100% ] 50 VUs  05m22.8s/10m0s  09970/10000 shared iters


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=1.78s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 10000   30.92207/s
    checks_succeeded...: 100.00% 10000 out of 10000
    checks_failed......: 0.00%   0 out of 10000

    ✓ status is 202

    CUSTOM
    successful_ingestions..........: 10000  30.92207/s

    HTTP
    http_req_duration..............: avg=966.05ms min=42.18ms  med=933.47ms max=5.84s p(90)=1.58s p(95)=1.78s
      { expected_response:true }...: avg=966.05ms min=42.18ms  med=933.47ms max=5.84s p(90)=1.58s p(95)=1.78s
    http_req_failed................: 0.00%  0 out of 10000
    http_reqs......................: 10000  30.92207/s

    EXECUTION
    iteration_duration.............: avg=1.61s    min=120.53ms med=1.54s    max=6.21s p(90)=2.49s p(95)=2.93s
    iterations.....................: 10000  30.92207/s
    vus............................: 30     min=30         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 810 kB 2.5 kB/s
    data_sent......................: 5.1 GB 16 MB/s



time="2026-08-08T08:57:46Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/scripts/k6-results.json': open /scripts/k6-results.json: permission denied"

running (05m23.4s), 00/50 VUs, 10000 complete and 0 interrupted iterations
load_test ✓ [ 100% ] 50 VUs  05m23.4s/10m0s  10000/10000 shared iters
time="2026-08-08T08:57:46Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"